---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ColorWithTransparency Constructor
ColorWithTransparency Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ColorWithTransparency()()()() | color |
|  | ColorWithTransparency(UInt32, UInt32, UInt32, UInt32) | color |

# See Also

ColorWithTransparency Class

ColorWithTransparency Members

Autodesk.Revit.DB Namespace